yinshilongger/stm32_f103zet6_study/pal/stm32f10x_pal_usart.c
/**
  ******************************************************************************
  * @file    stm32f10x_pal_uart.c
  * @author  铁头山羊stm32工作组
  * @version V1.0.0
  * @date    2023年1月7日
  * @brief   串口驱动
  ******************************************************************************
  * @attention
  * Copyright (c) 2022 - 2023 东莞市明玉科技有限公司. 保留所有权力.
  ******************************************************************************
*/

#include "stm32f10x_pal.h"
#include "stm32f10x_pal_usart.h"
#include "stdio.h"
#include "string.h"
#include "stdarg.h"

static void PAL_USART_ClockCmd(USART_TypeDef *USARTx, FunctionalState NewState);
static ErrorStatus PAL_USART_TxPinInit(PalUSART_HandleTypeDef *Handle);
static ErrorStatus PAL_USART_RxPinInit(PalUSART_HandleTypeDef *Handle);
static uint8_t PAL_USART_GetIRQChannel(PalUSART_HandleTypeDef *Handle);
static void PAL_USART_OnRXNE(PalUSART_HandleTypeDef *Handle);
static void PAL_USART_OnTXE(PalUSART_HandleTypeDef *Handle);


//
// @简介：将句柄的初始化参数设置为默认值
//        BaudRate                     = 9600， 默认9600波特率
//        USART_WordLength             = 8，    默认8位数据位
//        USART_StopBits               = 1，    默认1位停止位
//        USART_Parity                 = None， 默认不启用校验
//        USART_Mode                   = Tx|Rx，默认收发双向
//        USART_IRQ_PreemptionPriority = 0，    默认抢占优先级=0
//        USART_IRQ_SubPriority        = 0，    默认子优先级=0
//        RxBufferSize                 = 128，  默认接收队列长度128
//        TxBufferSize                 = 128，  默认发送队列长度128
// @注意：仍需要手动填写的项目
//        USARTx                       - 所使用的USART接口的名称
//
void PAL_USART_InitHandle(PalUSART_HandleTypeDef *Handle)
{
	Handle->Init.BaudRate = 9600;
	Handle->Init.USART_WordLength = USART_WordLength_8b;
	Handle->Init.USART_StopBits = USART_StopBits_1;
	Handle->Init.USART_Parity = USART_Parity_No;
	Handle->Init.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	Handle->Init.USART_IRQ_PreemptionPriority = 0;
	Handle->Init.USART_IRQ_SubPriority = 0;
	Handle->Init.RxBufferSize = 128;
	Handle->Init.TxBufferSize = 128;
}

// @简介：USART初始化
// @参数：Handle - USART的句柄指针
// @返回值：初始化是否成功，SUCCESS表示成功，其它表示失败
ErrorStatus PAL_USART_Init(PalUSART_HandleTypeDef *Handle)
{
	USART_InitTypeDef USART_InitStruct;
	NVIC_InitTypeDef NVIC_InitStruct;
	
	Handle->LastestCh = '\0';
	Handle->LineSeparatorCounter1 = 0;
	Handle->LineSeparatorCounter2 = 0;
	
	Handle->TxCmd = (Handle->Init.USART_Mode & USART_Mode_Tx) != 0 ? ENABLE : DISABLE;
	Handle->RxCmd = (Handle->Init.USART_Mode & USART_Mode_Rx) != 0 ? ENABLE : DISABLE;
	
	// 1. 初始化IO引脚
	if(Handle->TxCmd == ENABLE) { PAL_USART_TxPinInit(Handle); } // 初始化Tx引脚
	if(Handle->RxCmd == ENABLE) { PAL_USART_RxPinInit(Handle); } // 初始化Rx引脚
	
	// 2. 使能USART的时钟
	USART_DeInit(Handle->Init.USARTx); // 复位
	PAL_USART_ClockCmd(Handle->Init.USARTx, ENABLE);
	
	// 3. 配置USART的参数
	USART_InitStruct.USART_BaudRate = Handle->Init.BaudRate;
	USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None; // 该模式下默认关闭流控
	USART_InitStruct.USART_Mode = 0;
	USART_InitStruct.USART_Mode = Handle->Init.USART_Mode;
	USART_InitStruct.USART_Parity = Handle->Init.USART_Parity;
	USART_InitStruct.USART_StopBits = Handle->Init.USART_StopBits;
	USART_InitStruct.USART_WordLength = Handle->Init.USART_WordLength;
	USART_Init(Handle->Init.USARTx, &USART_InitStruct);
	
	// 4. 配置中断
	// 配置NVIC
	NVIC_InitStruct.NVIC_IRQChannel = PAL_USART_GetIRQChannel(Handle);
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = Handle->Init.USART_IRQ_PreemptionPriority;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = Handle->Init.USART_IRQ_SubPriority;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStruct);
	// 开启TXE中断
	if(Handle->TxCmd == ENABLE)
	{
		// 无需开启TXE中断
		// USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, ENABLE);
	}
	// 开启RXNE中断
	if(Handle->RxCmd == ENABLE)
	{
		USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, ENABLE);
	}
	
	// 5. 初始化缓冲区
	// 发送缓冲区
	if(Handle->TxCmd == ENABLE && PAL_ByteQueue_Init(&Handle->hTxQueue, Handle->Init.TxBufferSize) != SUCCESS)
	{
		return ERROR;
	}
	// 接收缓冲区
	if(Handle->RxCmd == ENABLE && PAL_ByteQueue_Init(&Handle->hRxQueue, Handle->Init.RxBufferSize) != SUCCESS)
	{
		return ERROR;
	}
	
	// 6. 闭合USART总开关
	USART_Cmd(Handle->Init.USARTx, ENABLE);
	
	return SUCCESS;
}

// @简介：USART中断处理代码
// @参数：Handle - USART句柄的指针
// @返回值：空
// @注意：此方法应当在对应的USART的中断响应函数中被调用
void PAL_USART_IRQHandler(PalUSART_HandleTypeDef *Handle)
{
	// 处理RXNE中断
	if(USART_GetITStatus(Handle->Init.USARTx, USART_IT_RXNE) == SET)
	{
		PAL_USART_OnRXNE(Handle);
	}
	if(USART_GetITStatus(Handle->Init.USARTx, USART_IT_TXE) == SET)
	{
		PAL_USART_OnTXE(Handle);
	}
}

// @简介：发送一个字节
// @参数：Handle - USART句柄的指针
// @参数：Data - 要发送的字节
void PAL_USART_SendByte(PalUSART_HandleTypeDef *Handle, uint8_t Data)
{
	if(Handle->TxCmd == ENABLE)
	{
		USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, DISABLE);
		PAL_ByteQueue_EnqueueEx(&Handle->hTxQueue, Data); 
		USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, ENABLE);
	}
}

// @简介：发送一个字节
// @参数：Handle - USART句柄的指针
// @参数：c - 要发送的字符
void PAL_USART_PutChar(PalUSART_HandleTypeDef *Handle, char c)
{
	if(Handle->TxCmd == ENABLE)
	{
		USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, DISABLE);
		PAL_ByteQueue_EnqueueEx(&Handle->hTxQueue, c); 
		USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, ENABLE);
	}
}

// @简介：发送多个字节
// @参数：Handle - USART句柄的指针
// @参数：pData - 要发送的字节数组的指针
// @参数：Size - 要发送的数据个数
void PAL_USART_SendBytes(PalUSART_HandleTypeDef *Handle, const uint8_t* pData, uint16_t Size)
{
	if(Handle->TxCmd == ENABLE)
	{
		USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, DISABLE);
		PAL_ByteQueue_EnqueueBatchEx(&Handle->hTxQueue, pData, Size); 
		USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, ENABLE);
	}
}

// @简介：接收单个字节
// @参数：Handle - USART句柄的指针
// @参数：Timeout - 超时值，如果此参数填写PAL_MAX_DELAY则永不超时
// @返回值：接收到的字节，如果返回值小于0表示接收失败（超时）
int16_t PAL_USART_ReceiveByte(PalUSART_HandleTypeDef *Handle, uint32_t Timeout)
{
	if(Handle->RxCmd != ENABLE) return 0;
	
	int16_t ret = -1;
	uint8_t tmp;
	uint64_t expiredTime = PAL_GetTick() + Timeout;
	
	do
	{
		if(PAL_ByteQueue_GetLength(&Handle->hRxQueue) != 0)
		{
			USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, DISABLE);
			if(PAL_ByteQueue_GetLength(&Handle->hRxQueue) != 0)
			{
				PAL_ByteQueue_Dequeue(&Handle->hRxQueue, &tmp);
				
				ret = tmp;
				
				if(Handle->LineSeparatorCounter2 != 0)
				{
					Handle->LineSeparatorCounter2--;
					if(Handle->LineSeparatorCounter2 == 0)
					{
						Handle->LineSeparatorCounter1 = 0;
					}
				}
			}
			USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, ENABLE);
			break;
		}
	}
	while(Timeout == PAL_MAX_DELAY || PAL_GetTick() < expiredTime);
	
	return ret;
}

// @简介：接收多个字节
// @参数：Handle - USART句柄的指针
// @参数：pData - 缓冲区指针，用户需为接收此数据提供一个缓冲区，该参数为此缓冲区的指针
// @参数：Size  - 该缓冲区（pData）的最大长度
// @参数：Timeout - 超时值，单位毫秒。当超过此时间仍未接收到足够数量的数据时该方法提前返回
//                  当Timeout等于0时，无论是否接收到足够的数据，该方法立即返回；
//                  当Timeout等于PAL_MAX_Delay时，该方法永不超时
// @返回值：实际接收到的字节数量
uint16_t PAL_USART_ReceiveBytes(PalUSART_HandleTypeDef *Handle, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
	uint16_t num_of_bytes_2_read;
	uint16_t queue_length;
	uint64_t expiredTime;
	
	if(Handle->RxCmd != ENABLE) return 0;
	
	if(Timeout != 0)
	{
		expiredTime = PAL_GetTick() + Timeout;
		
		while(( Timeout == PAL_MAX_DELAY || PAL_GetTick() < expiredTime) && PAL_ByteQueue_GetLength(&Handle->hRxQueue) < Size);
	}
	
	num_of_bytes_2_read = Size;
	
	USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, DISABLE);
	
