yinshilongger/stm32_f103zet6_study/pal/stm32f10x_pal_usart.c
	queue_length = PAL_ByteQueue_GetLength(&Handle->hRxQueue);
	
	if(queue_length < num_of_bytes_2_read)
	{
		num_of_bytes_2_read = queue_length;
	}
	
	PAL_ByteQueue_DequeueBatch(&Handle->hRxQueue, pData, num_of_bytes_2_read);
	
	if(Handle->LineSeparatorCounter2 != 0)
	{
		if(num_of_bytes_2_read > Handle->LineSeparatorCounter2)
		{
			Handle->LineSeparatorCounter2 = 0;
		}
		else
		{
			Handle->LineSeparatorCounter2 -= num_of_bytes_2_read;
		}
		if(Handle->LineSeparatorCounter2 == 0)
		{
			Handle->LineSeparatorCounter1 = 0;
		}
	}
	
	USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, ENABLE);
	
	return num_of_bytes_2_read;
}

// @简介：接收一行字符串
// @参数：Handle - USART句柄的指针
// @参数：pBuffer - 缓冲区指针，用户需为接收此数据提供一个缓冲区，该参数为此缓冲区的指针
// @参数：Size  - 该缓冲区（pData）的最大长度
// @参数：Timeout - 超时值，单位毫秒。当超过此时间仍未接收到足够数量的数据时该方法提前返回
//                  当Timeout等于0时，无论是否接收到足够的数据，该方法立即返回；
//                  当Timeout等于PAL_MAX_Delay时，该方法永不超时
// @返回值：实际接收到的字节数量
// @注意：有三种行分隔符可选，分别是LF(\n)，CR(\r)和CR+LF(\r\n)，可以在初始化时进行设置
uint16_t PAL_USART_ReadLine(PalUSART_HandleTypeDef *Handle, char *pBuffer, uint16_t Size, uint32_t Timeout)
{
	uint64_t expiredTime;
	uint16_t strlen = 0;
	uint8_t currentByte, previousByte = 0;
	
	if(Timeout != 0)
	{
		expiredTime = PAL_GetTick() + Timeout;
	}
	
	do
	{
		if(Timeout == 0 || Handle->LineSeparatorCounter1 != 0)
		{
			USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, DISABLE);
			if(Timeout != 0 && Handle->LineSeparatorCounter1 == 0) // 在禁用中断之前行结束符被丢弃了
			{
				continue;
			}
			
			for(; Handle->LineSeparatorCounter1 > 0; )
			{
				PAL_ByteQueue_Dequeue(&Handle->hRxQueue, &currentByte);
				
				if(strlen < Size - 1)
				{
					pBuffer[strlen++] = currentByte;
				}
				
				Handle->LineSeparatorCounter2--;
				
				if(Handle->LineSeparatorCounter2 == 0)
				{
					Handle->LineSeparatorCounter1 = 0;
				}
				
				if((Handle->Init.Advanced.LineSeparator == LineSeparator_CRLF 
					&& previousByte == '\r' && currentByte == '\n')
				||(Handle->Init.Advanced.LineSeparator == LineSeparator_CR
					&& currentByte == '\r')
				||(Handle->Init.Advanced.LineSeparator == LineSeparator_LF
					&& currentByte == '\n'))
				{
					break;
				}
				
				previousByte = currentByte;
			}
			
			pBuffer[strlen] = '\0';
			USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, ENABLE);
			
			break;
		}
	}
	while((Timeout == PAL_MAX_DELAY)||(PAL_GetTick() < expiredTime));
	
	return strlen;
}

// @简介：修改串口的波特率
// @参数：Handle - USART句柄的指针
// @参数：NewBaudrate - 新的波特率值
void PAL_USART_ChangeBaudrate(PalUSART_HandleTypeDef *Handle, uint32_t NewBaudrate)
{
	uint32_t tmpreg = 0x00;
	uint32_t usartxbase = 0x00, apbclock = 0x00;
	RCC_ClocksTypeDef RCC_ClocksStatus;
	uint32_t integerdivider = 0x00;
	uint32_t fractionaldivider = 0x00;
	
  RCC_GetClocksFreq(&RCC_ClocksStatus);
  if (usartxbase == USART1_BASE)
  {
    apbclock = RCC_ClocksStatus.PCLK2_Frequency;
  }
  else
  {
    apbclock = RCC_ClocksStatus.PCLK1_Frequency;
  }
  
  /* Determine the integer part */
  if ((Handle->Init.USARTx->CR1 & 0x8000) != 0)
  {
    /* Integer part computing in case Oversampling mode is 8 Samples */
    integerdivider = ((25 * apbclock) / (2 * NewBaudrate));    
  }
  else /* if ((USARTx->CR1 & CR1_OVER8_Set) == 0) */
  {
    /* Integer part computing in case Oversampling mode is 16 Samples */
    integerdivider = ((25 * apbclock) / (4 * NewBaudrate));    
  }
  tmpreg = (integerdivider / 100) << 4;

  /* Determine the fractional part */
  fractionaldivider = integerdivider - (100 * (tmpreg >> 4));

  /* Implement the fractional part in the register */
  if ((Handle->Init.USARTx->CR1 & 0x8000) != 0)
  {
    tmpreg |= ((((fractionaldivider * 8) + 50) / 100)) & ((uint8_t)0x07);
  }
  else /* if ((USARTx->CR1 & CR1_OVER8_Set) == 0) */
  {
    tmpreg |= ((((fractionaldivider * 16) + 50) / 100)) & ((uint8_t)0x0F);
  }
  
	USART_Cmd(Handle->Init.USARTx, DISABLE);
  /* Write to USART BRR */
  Handle->Init.USARTx->BRR = (uint16_t)tmpreg;
	
	USART_Cmd(Handle->Init.USARTx, ENABLE);
	
	Handle->Init.BaudRate = NewBaudrate;
}

// @简介：返回当前接收缓冲区内待读取的数据量
// @参数：Handle - USART句柄的指针
// @返回值：待读取的数据量，以字节为单位
uint16_t PAL_USART_NumberOfBytesToRead(PalUSART_HandleTypeDef *Handle)
{
	uint16_t ret = 0;
	
	if(Handle->RxCmd != ENABLE) return 0;
	
	USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, DISABLE);
	
	ret = PAL_ByteQueue_GetLength(&Handle->hRxQueue);
	
	USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, ENABLE);
	
	return ret;
}

// @简介：通过串口发送字符换
// @参数：Handle - USART句柄的指针
// @参数：Str    - 要发送的字符串
void PAL_USART_SendString(PalUSART_HandleTypeDef *Handle, const char *Str)
{
	PAL_USART_SendBytes(Handle, (const uint8_t *)Str, strlen(Str));
}

// @简介：通过串口打印格式化字符串
// @参数：Handle - USART句柄的指针
// @参数：format - 格式字符串
// @参数：...    - 可变参数
// @注意：单次格式化的字符串长度不得超过256个
void PAL_USART_Printf(PalUSART_HandleTypeDef *Handle, const char* format, ...)
{
	uint8_t format_buffer[256];
	
	if(Handle->TxCmd != ENABLE) return;
	
	va_list argptr;
	__va_start(argptr, format);
	vsprintf((char* )format_buffer, format, argptr);
	__va_end(argptr);
	PAL_USART_SendBytes(Handle, format_buffer, strlen((char*)format_buffer));
}

// @简介：调用此方法可以清空接收缓冲区的内容
// @参数：Handle - USART句柄的指针
void PAL_USART_DiscardInBuffer(PalUSART_HandleTypeDef *Handle)
{
	if(Handle->RxCmd == ENABLE)
	{
		USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, DISABLE);
		Handle->LastestCh = '\0';
		Handle->LineSeparatorCounter1 = 0;
		Handle->LineSeparatorCounter2 = 0;
		PAL_ByteQueue_Clear(&Handle->hRxQueue);
		USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, ENABLE);
	}
}

// @简介：调用此方法可以清空发送缓冲区的内容
// @参数：Handle - USART句柄的指针
void PAL_USART_DiscardOutBuffer(PalUSART_HandleTypeDef *Handle)
{
	if(Handle->TxCmd == ENABLE)
	{
		USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, DISABLE);
		PAL_ByteQueue_Clear(&Handle->hTxQueue);
	}
}

// @简介：获取发送缓冲区的最高占用率
// @参数：Handle - USART的句柄指针
// @返回值：发送缓冲区的最高占用率，用百分数表示，范围0~100
uint16_t PAL_USART_GetTxBufferOccupancy(PalUSART_HandleTypeDef *Handle)
{
	uint16_t result = 0;
	
	USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, DISABLE);
	result = PAL_ByteQueue_GetOccupancy(&Handle->hTxQueue);
	USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, ENABLE);
	
	return result;
}

// @简介：获取接收缓冲区的最高占用率
// @参数：Handle - USART的句柄指针
// @返回值：接收缓冲区的最高占用率，用百分数表示，范围0~100
uint16_t PAL_USART_GetRxBufferOccupancy(PalUSART_HandleTypeDef *Handle)
{
	uint16_t result = 0;
	
	USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, DISABLE);
	result = PAL_ByteQueue_GetOccupancy(&Handle->hRxQueue);
	USART_ITConfig(Handle->Init.USARTx, USART_IT_RXNE, ENABLE);
	
	return result;
}

// @简介：通过USART打印一行日志，日志采用以下格式
//        [hh:mm:ss.sss] 警告级别：详细信息 
// @参数：Handle - USART的句柄指针
// @参数：WarningLevel - 警告级别，可以取以下值之一：
//                          @WarningLevel_Info - 信息 
//                          @WarningLevel_Warning - 警告 
//                          @WarningLevel_Error - 错误
// @参数：Format       - 格式字符串，用于填写详细信息的格式
// @参数：...          - 可变参数
void PAL_USART_Log(PalUSART_HandleTypeDef *Handle, uint16_t WarningLevel, const char *Format, ...)
{
	uint64_t currentTick = PAL_GetTick();
	uint32_t h, m, s, ms;
	
