yinshilongger/stm32_f103zet6_study/pal/stm32f10x_pal_usart.c
	if(Handle->TxCmd != ENABLE) return;
	
	currentTick = PAL_GetTick();
	h = currentTick / 1000 / 60 /60;
	m = currentTick / 1000 / 60 % 60;
	s = currentTick / 1000 % 60;
	ms = currentTick % 1000;
	
	PAL_USART_SendString(Handle, "\r\n"); // 打印换行回车
	
	// 1. 显示时间
	PAL_USART_Printf(Handle, "[%02d:%02d:%02d.%03d]", h, m, s, ms); 
	PAL_USART_PutChar(Handle, ' '); // 打印空格
	
	// 2. 打印警告级别
	switch(WarningLevel)
  {
		case WarningLevel_Info:
			PAL_USART_SendString(Handle, "Info"); break;
		case WarningLevel_Warning:
			PAL_USART_SendString(Handle, "Warning");break;
		case WarningLevel_Error:
			PAL_USART_SendString(Handle, "Error"); break;
		default: break;
	}
	
	// 3. 打印详细信息
	uint8_t format_buffer[256];
	va_list argptr;
	
	PAL_USART_SendString(Handle, ": "); // 打印冒号和空格
	
	__va_start(argptr, Format);
	vsprintf((char* )format_buffer, Format, argptr);
	__va_end(argptr);
	PAL_USART_SendString(Handle, (const char *)format_buffer);
	
	PAL_USART_SendString(Handle, "\r\n"); // 打印换行回车
}

static void PAL_USART_ClockCmd(USART_TypeDef *USARTx, FunctionalState NewState)
{
	if(USARTx == USART1)
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	}
	else if(USARTx == USART2)
	{
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	}
	else if(USARTx == USART3)
	{
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
	}
	else if(USARTx == UART4)
	{
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
	}
	else if(USARTx == UART5)
	{
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);
	}
}


static ErrorStatus PAL_USART_TxPinInit(PalUSART_HandleTypeDef *Handle)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_10MHz;
	
	if(Handle->Init.USARTx == USART1)
	{
		if(Handle->Init.Advanced.Remap == 0) // 无重映射
		{
			// PA9 -> USART_Tx
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_9;
			GPIO_Init(GPIOA, &GPIO_InitStruct);
		}
		else if(Handle->Init.Advanced.Remap == 1) // 完全重映射
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
			GPIO_PinRemapConfig(GPIO_Remap_USART1, ENABLE);
			// PB6 -> USART_Tx
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6;
			GPIO_Init(GPIOB, &GPIO_InitStruct);
		}
		else
		{
			return ERROR; // 参数有错
		}
	}
	else if(Handle->Init.USARTx == USART2)
	{
		if(Handle->Init.Advanced.Remap == 0)
		{
			// PA2 -> USART_Tx 复用推挽
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2;
			GPIO_Init(GPIOA, &GPIO_InitStruct);
		}
		else if(Handle->Init.Advanced.Remap == 1)
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
			GPIO_PinRemapConfig(GPIO_Remap_USART2, ENABLE);
			// PD5 -> USART_Tx 复用推挽
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_5;
			GPIO_Init(GPIOD, &GPIO_InitStruct);
		}
		else
		{
			return ERROR;
		}
	}
	else if(Handle->Init.USARTx == USART3)
	{
		if(Handle->Init.Advanced.Remap == 0)
		{
			// PB10 -> USART_Tx 复用推挽
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
			GPIO_Init(GPIOB, &GPIO_InitStruct);
		}
		else if(Handle->Init.Advanced.Remap == 1)
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
			GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, ENABLE);
			// PC10 -> USART_Tx 复用推挽
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
			GPIO_Init(GPIOC, &GPIO_InitStruct);
		}
		else if(Handle->Init.Advanced.Remap == 3)
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
			GPIO_PinRemapConfig(GPIO_FullRemap_USART3, ENABLE);
			// PD8 -> USART_Tx 复用推挽
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_8;
			GPIO_Init(GPIOD, &GPIO_InitStruct);
		}
		else
		{
			return ERROR;
		}
	}
	else if(Handle->Init.USARTx == UART4)
	{
		// PC10 -> USART_Tx 复用推挽
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
		GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
		GPIO_Init(GPIOC, &GPIO_InitStruct);
	}
	else if(Handle->Init.USARTx == UART5)
	{
		// PC12 -> USART_Tx 复用推挽
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
		GPIO_InitStruct.GPIO_Pin = GPIO_Pin_12;
		GPIO_Init(GPIOC, &GPIO_InitStruct);
	}
	else
	{
		return ERROR;
	}
	return SUCCESS;
}

static ErrorStatus PAL_USART_RxPinInit(PalUSART_HandleTypeDef *Handle)
{
	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
	// 初始化Rx引脚
	if(Handle->Init.USARTx == USART1)
	{
		if(Handle->Init.Advanced.Remap == 0)
		{
			// PA10 -> USART_Rx 输入浮空
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
			GPIO_Init(GPIOA, &GPIO_InitStruct);
		}
		else if(Handle->Init.Advanced.Remap == 1)
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
			GPIO_PinRemapConfig(GPIO_Remap_USART1, ENABLE);
			// PB7 -> USART_Rx 输入浮空
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_7;
			GPIO_Init(GPIOB, &GPIO_InitStruct);
		}
		else
		{
			return ERROR;
		}
	}
	else if(Handle->Init.USARTx == USART2)
	{
		if(Handle->Init.Advanced.Remap == 0)
		{
			// PA3 -> USART_Rx 输入浮空
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3;
			GPIO_Init(GPIOA, &GPIO_InitStruct);
		}
		else if(Handle->Init.Advanced.Remap == 1)
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
			GPIO_PinRemapConfig(GPIO_Remap_USART2, ENABLE);
			// PD6 -> USART_Rx 输入浮空
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6;
			GPIO_Init(GPIOD, &GPIO_InitStruct);
		}
		else
		{
			return ERROR;
		}
	}
	else if(Handle->Init.USARTx == USART3)
	{
		if(Handle->Init.Advanced.Remap == 0)
		{
			// PB11 -> USART_Rx 输入浮空
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_11;
			GPIO_Init(GPIOB, &GPIO_InitStruct);
		}
		else if(Handle->Init.Advanced.Remap == 1)
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
			GPIO_PinRemapConfig(GPIO_PartialRemap_USART3, ENABLE);
			// PC11 -> USART_Rx 输入浮空
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_11;
			GPIO_Init(GPIOC, &GPIO_InitStruct);
		}
		else if(Handle->Init.Advanced.Remap == 3)
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
			GPIO_PinRemapConfig(GPIO_FullRemap_USART3, ENABLE);
			// PD9 -> USART_Rx 输入浮空
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
			GPIO_InitStruct.GPIO_Pin = GPIO_Pin_9;
			GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
			GPIO_Init(GPIOD, &GPIO_InitStruct);
		}
		else
		{
			return ERROR;
		}
	}
  else if(Handle->Init.USARTx == UART4) // PC11
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
		GPIO_InitStruct.GPIO_Pin = GPIO_Pin_11;
		GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
		GPIO_Init(GPIOC, &GPIO_InitStruct);
	}	
	else if(Handle->Init.USARTx == UART5) // PD2
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
		GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2;
		GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
		GPIO_Init(GPIOD, &GPIO_InitStruct);
	}
	else 
	{
		return ERROR;
	}
	
	return SUCCESS;
}

