yinshilongger/stm32_f103zet6_study/pal/stm32f10x_pal_usart.c
static uint8_t PAL_USART_GetIRQChannel(PalUSART_HandleTypeDef *Handle)
{
	uint8_t result = 0;
	
	if(Handle->Init.USARTx == USART1)
	{
		result = 37;
	}
	else if(Handle->Init.USARTx == USART2)
	{
		result = 38;
	}
	else if(Handle->Init.USARTx == USART3)
	{
		result = 39;
	}
	else if(Handle->Init.USARTx == UART4)
	{
		result = 52;
	}
	else if(Handle->Init.USARTx == UART5)
	{
		result = 53;
	}
	
	return result;
}

static void PAL_USART_OnRXNE(PalUSART_HandleTypeDef *Handle)
{
	uint8_t byte_received;
	
	// 1. 接收数据
	byte_received = (uint8_t)USART_ReceiveData(Handle->Init.USARTx);
	
	// 2. 处理数据
	// 2.1. 处理换行
	if(Handle->Init.Advanced.LineSeparator != LineSeparator_Disable)
	{
		// 判断是否接收到了新行
		switch(Handle->Init.Advanced.LineSeparator)
		{
			case LineSeparator_CR:
			{
				if(byte_received == '\r' && Handle->hRxQueue.innerObjectQueue.Capcity > 1 )
				{
					Handle->LineSeparatorCounter1 = Handle->hRxQueue.innerObjectQueue.Capcity - 1;
					Handle->LineSeparatorCounter2 = PAL_ByteQueue_GetLength(&Handle->hRxQueue) + 1;
					if(Handle->LineSeparatorCounter2 == Handle->hRxQueue.innerObjectQueue.Capcity)
					{
						Handle->LineSeparatorCounter2--;
					}
				}
				else
				{
					if(Handle->LineSeparatorCounter1 != 0)
					{
						Handle->LineSeparatorCounter1--;
					}
				}
				break;
			}
			case LineSeparator_LF:
			{
				if(byte_received == '\n' && Handle->hRxQueue.innerObjectQueue.Capcity > 1)
				{
					Handle->LineSeparatorCounter1 = Handle->hRxQueue.innerObjectQueue.Capcity - 1;
					Handle->LineSeparatorCounter2 = PAL_ByteQueue_GetLength(&Handle->hRxQueue) + 1;
					if(Handle->LineSeparatorCounter2 == Handle->hRxQueue.innerObjectQueue.Capcity)
					{
						Handle->LineSeparatorCounter2--;
					}
				}
				else
				{
					if(Handle->LineSeparatorCounter1 != 0)
					{
						Handle->LineSeparatorCounter1--;
					}
				}
				break;
			}
			case LineSeparator_CRLF:
			{
				if(byte_received == '\n' && Handle->LastestCh == '\r' && Handle->hRxQueue.innerObjectQueue.Capcity > 2)
				{
					Handle->LineSeparatorCounter1 = Handle->hRxQueue.innerObjectQueue.Capcity - 2;
					Handle->LineSeparatorCounter2 = PAL_ByteQueue_GetLength(&Handle->hRxQueue) + 1;
					if(Handle->LineSeparatorCounter2 == Handle->hRxQueue.innerObjectQueue.Capcity)
					{
						Handle->LineSeparatorCounter2--;
					}
				}
				else
				{
					if(Handle->LineSeparatorCounter1 != 0)
					{
						Handle->LineSeparatorCounter1--;
					}
				}
				break;
			}
		}
	}
	
	Handle->LastestCh = byte_received;
	
	if(Handle->LineSeparatorCounter1 == 0)
	{
		Handle->LineSeparatorCounter2 = 0;
	}
	
	// 2.2. 将数据存储到缓冲区
	// 如果环形队列满，则自动删除掉最早的元素
	PAL_ByteQueue_EnqueueEx(&Handle->hRxQueue, byte_received);
}

static void PAL_USART_OnTXE(PalUSART_HandleTypeDef *Handle)
{
	uint8_t byteToSend;
	// 如果数据发送完成
	// 关闭TXE中断
	if(PAL_ByteQueue_GetLength(&Handle->hTxQueue) == 0)
	{
		USART_ITConfig(Handle->Init.USARTx, USART_IT_TXE, DISABLE);
	}
	else
	{
		// 从队列取出一个元素发送
		PAL_ByteQueue_Dequeue(&Handle->hTxQueue, &byteToSend);
		USART_SendData(Handle->Init.USARTx, byteToSend);
	}
}
